*** =__index= metamethod
    当你通过键来访问 =table= 的时候，如果这个键没有值，那么 =Lua= 就会
    寻找该 =table= 的 =metatable= （假定有 =metatable= ）中的 =__index= 键。
    如果 =__index= 包含一个表格， =Lua= 会在表格中查找相应的键。 
    #+BEGIN_SRC lua :results output
      other = { foo = 3 }
      t = setmetatable({}, { __index = other })
      print(t.foo)

      print(t.bar)
    #+END_SRC

    #+RESULTS:
    : 3
    : nil

    如果 =__index= 包含一个函数的话， =Lua= 就会调用那个函数， =table=
    和键会作为参数传递给函数。 =__index= 元方法查看表中元素是否存在，如果
    不存在，返回结果为 =nil= ；如果存在则由 =__index= 返回结果。
    #+BEGIN_SRC lua :results output
      mytable = setmetatable({key1 = "value1"}, {
        __index = function(mytable, key)
          if key == "key2" then
            return "metatablevalue"
          else
            return nil
          end
        end
      })

      print('hello world')
      print(mytable.key1,mytable.key2)
    #+END_SRC

    #+RESULTS:
    : hello world
    : value1	metatablevalue

    1. 在表中查找，如果找到，返回该元素，找不到则继续
    2. 判断该表是否有元表，如果没有元表，返回 =nil= ，有元表则继续。
    3. 判断元表有没有 =__index= 方法，如果 =__index= 方法为 =nil= ，则返回 =nil= ；如
       果 =__index= 方法是一个表，则重复1、2、3；如果 =__index= 方法是一个函数，
       则返回该函数的返回值。
*** =__newindex= 
    =__newindex= 元方法用来对表更新 =__newindex= 则用来对表访问 。
    当你给表的一个缺少的索引赋值，解释器就会查找 =__newindex= 元方法：如
    果存在则调用这个函数而不进行赋值操作。 
    #+BEGIN_SRC lua :results output
      mymetatable = {}
      mytable = setmetatable({key1 = "value1"}, { __newindex = mymetatable })

      print(mytable.key1)

      mytable.newkey = "新值2"
      print(mytable.newkey,mymetatable.newkey)

      mytable.key1 = "新值1"
      print(mytable.key1,mymetatable.key1)
    #+END_SRC

    #+RESULTS:
    : value1
    : nil	新值2
    : 新值1	nil


    以上实例中表设置了元方法 =__newindex= ，在对新索引键（newkey）赋值时
    （mytable.newkey = "新值2"），会调用元方法，而不进行赋值。而如果对
    已存在的索引键（key1），则会进行赋值，而不调用元方法 =__newindex=
    。 
    #+RESULTS:
    : new value	"4"

    #+BEGIN_SRC lua :results output
      mytable = setmetatable({key1 = "value1"}, {
        __newindex = function(mytable, key, value)
              rawset(mytable, key, "\""..value.."\"")

        end
      })

      mytable.key1 = "new value"
      mytable.key2 = 4

      print(mytable.key1,mytable.key2)
    #+END_SRC
*** iterate =string=
    #+BEGIN_SRC lua :results output
      a = 'fds.fd.ds'

      for char in a:gmatch"." do
         print(char)
      end
    #+END_SRC

    #+RESULTS:
    : f
    : d
    : s
    : .
    : f
    : d
    : .
    : d
    : s
